{
  "backend/main.mo": "Actor canister managing user profiles with access control and handling public form submissions with validation and admin-only retrieval.",
  "feature_evidence.json": "Feature evidence report mapping product requirements to related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for all frontend components and pages in the project.",
  "frontend/index.css": "Tailwind CSS configuration defining theme variables, dark mode values, and base styling for the site.",
  "frontend/index.html": "Base HTML entry file mounting the React app and loading the main TypeScript bundle.",
  "frontend/src/App.tsx": "Sets up TanStack Router with all top-level routes and wraps the app in the router provider.",
  "frontend/src/components/archive/ArchiveBrowser.tsx": "Tabbed archive browser that filters items by category and opens a detail dialog for selected entries.",
  "frontend/src/components/archive/ArchiveItemDetailDialog.tsx": "Dialog displaying full metadata, description, notes, and source citations for a selected archive item.",
  "frontend/src/components/common/SourcesCitationsBlock.tsx": "Component rendering a sources list or a placeholder when citations are missing.",
  "frontend/src/components/contributions/ContributionsForm.tsx": "Form component for submitting contributions with validation, state handling, and API submission via useSubmitContribution.",
  "frontend/src/components/contributions/SubmissionSuccessPanel.tsx": "Displays a success message and reset button after a contribution is submitted.",
  "frontend/src/components/current-generation/ProfileCard.tsx": "Renders a profile card showing a family member’s name, titles, and description.",
  "frontend/src/components/layout/Footer.tsx": "Footer with copyright text and a referral link to caffeine.ai.",
  "frontend/src/components/layout/SiteLayout.tsx": "Top-level layout wrapping navigation, main content, and footer with a parchment background.",
  "frontend/src/components/lineage/FamilyTree.tsx": "Displays lineage data as a hierarchical tree on desktop and an accordion on mobile, with person detail popups.",
  "frontend/src/components/lineage/PersonDetailsPanel.tsx": "Dialog panel showing detailed information about a selected lineage person.",
  "frontend/src/components/navigation/TopNav.tsx": "Responsive top navigation bar with desktop links and a mobile slide-out menu.",
  "frontend/src/components/timeline/TimelineList.tsx": "Accordion-based timeline list showing events, descriptions, and optional sources.",
  "frontend/src/content/archive.ts": "Static dataset of archive items including photographs and documents with metadata.",
  "frontend/src/content/currentGeneration.ts": "Static profiles describing current-generation members of the Sharma family.",
  "frontend/src/content/historyContent.ts": "Defines structured historical content for the founding era and Akhnoor sovereignty, including titles, sections, and placeholder research notes.",
  "frontend/src/content/lineage.ts": "Provides an array describing the Sharma family lineage with IDs, titles, periods, and brief biographies.",
  "frontend/src/content/timeline.ts": "Exports chronological timeline data detailing major events in the Sharma family's history.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor based on Internet Identity, and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context, handling login, stored identity loading, and status tracking.",
  "frontend/src/hooks/usePageMeta.ts": "Hook for setting the document title and meta description on page load or update.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder module noting that backend interactions are handled elsewhere.",
  "frontend/src/hooks/useSubmitContribution.ts": "Defines a mutation hook to submit contributions via the backend actor and invalidate related queries on success.",
  "frontend/src/index.css": "Tailwind base styles plus extensive CSS variables defining light and dark heritage-themed color palettes and typography rules.",
  "frontend/src/main.tsx": "Application entry point that mounts React, sets up React Query, and wraps the app in the Internet Identity provider.",
  "frontend/src/pages/AkhnoorSovereigntyPage.tsx": "Renders the Akhnoor Sovereignty history page, setting page metadata and displaying structured content sections with optional citations.",
  "frontend/src/pages/ContactContributionsPage.tsx": "Displays a contributions contact page with a form, success state handling, and descriptive text about submitting materials.",
  "frontend/src/pages/CurrentGenerationPage.tsx": "Shows profiles for the current Sharma family generation and includes a section on preserving family traditions.",
  "frontend/src/pages/FortsResidencesPage.tsx": "Presents detailed information about Akhnoor Fort and other residences using styled cards and historical descriptions.",
  "frontend/src/pages/FoundingEraPage.tsx": "Renders the Founding Era history page, mapping structured content with sections, paragraphs, and sources.",
  "frontend/src/pages/GalleryArchivesPage.tsx": "Displays the archive and gallery browser with page metadata and a brief introduction.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with a hero section and highlight cards linking to key areas of the archive.",
  "frontend/src/pages/LineageFamilyTreePage.tsx": "Shows the family tree visualization with metadata and a note on the current generation.",
  "frontend/src/pages/Post1947TransitionPage.tsx": "Renders the Post-1947 Transition history page, setting meta tags and displaying structured content sections with optional citations and a future research block.",
  "frontend/src/pages/RoyalAdministrationLegacyPage.tsx": "Renders the Royal Administration & Legacy page, applying meta tags and showing historical sections with citations and an optional future research notice.",
  "frontend/src/pages/TimelinePage.tsx": "Displays the historical timeline page, setting meta tags and rendering the TimelineList component.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading and persisting URL parameters via query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, container settings, animations, and extended theme options for the site.",
  "project_state.json": "Defines the project’s state, goals, design principles, features, and required images for the heritage archive site."
}